{
  "apply_query_key_layer_scaling": false,
  "attention_config": [
    [
      [
        "flash"
      ],
      "all"
    ]
  ],
  "attention_dropout": 0,
  "attention_softmax_in_fp32": false,
  "bias_dropout_fusion": false,
  "bias_gelu_fusion": false,
  "bos_token_id": 1,
  "eod_mask_loss": false,
  "eos_token_id": 2,
  "gpt_j_residual": false,
  "gpt_j_tied": false,
  "hidden_act": "swish",
  "hidden_dropout": 0,
  "hidden_size": 5120,
  "init_method": "small_init",
  "initializer_range": 0.02,
  "intermediate_size": 13824,
  "llama_mlp_multiple_of": 256,
  "lora": false,
  "max_position_embeddings": 2048,
  "mlp_type": "llama",
  "model_type": "llama",
  "norm": "rmsnorm",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "output_layer_init_method": "wang_init",
  "output_layer_parallelism": "column",
  "pad_token_id": 0,
  "pos_emb": "rotary",
  "rms_norm_epsilon": 1e-06,
  "rotary_emb_base": 10000,
  "rotary_pct": 1,
  "scaled_masked_softmax_fusion": true,
  "scaled_upper_triang_masked_softmax_fusion": false,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.28.0.dev0",
  "use_bias_in_attn_linear": false,
  "use_cache": true,
  "use_parallel_residual": false,
  "vocab_size": 39424
}
